Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform1.5.7 plan -input=false -refresh -out \"/atlantis-data/repos/techtales-io/terraform-github/1/default/terraform-github-default.tfplan\"" in "/atlantis-data/repos/techtales-io/terraform-github/1/default": exit status 1
tyriis

sh: missing ]

module.repositories.module.terraform_github.data.sops_file.secrets: Reading...
module.repositories.module.terraform_gworkspace.data.sops_file.secrets: Reading...
module.organization.data.sops_file.secrets: Reading...
module.repositories.module.terraform_github.github_repository_webhook.atlantis: Refreshing state... [id=459750501]
module.organization.github_membership.admins["techtales-automation"]: Refreshing state... [id=techtales-io:techtales-automation]
module.organization.github_membership.admins["jazzlyn"]: Refreshing state... [id=techtales-io:jazzlyn]
module.organization.github_membership.admins["tyriis"]: Refreshing state... [id=techtales-io:tyriis]
module.repositories.module.terraform_gworkspace.github_repository.repo: Refreshing state... [id=terraform-gworkspace]
module.repositories.module.terraform_vault.github_repository.repo: Refreshing state... [id=terraform-vault]
module.repositories.module.techtales_io_github_io.github_repository.repo: Refreshing state... [id=techtales-io.github.io]
module.repositories.module.mkdocs_blog.github_repository.repo: Refreshing state... [id=mkdocs-blog]
module.repositories.module.backstage_docs.github_repository.repo: Refreshing state... [id=backstage-docs]
module.repositories.module.website.github_repository.repo: Refreshing state... [id=website]
module.repositories.module.terraform_github.github_repository.repo: Refreshing state... [id=terraform-github]
module.repositories.module.terraform_gcloud.github_repository.repo: Refreshing state... [id=terraform-gcloud]
module.repositories.module.terraform_gworkspace.github_branch_default.repo: Refreshing state... [id=terraform-gworkspace]
module.repositories.module.terraform_vault.github_branch_default.repo: Refreshing state... [id=terraform-vault]
module.repositories.module.mkdocs_blog.github_branch_default.repo: Refreshing state... [id=mkdocs-blog]
module.repositories.module.backstage_docs.github_branch_default.repo: Refreshing state... [id=backstage-docs]
module.repositories.module.terraform_github.github_branch_default.repo: Refreshing state... [id=terraform-github]
module.repositories.module.terraform_gcloud.github_branch_default.repo: Refreshing state... [id=terraform-gcloud]
module.repositories.module.backstage_docs.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKNE3pc4CqyHJ]
module.repositories.module.terraform_github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK3hVxs4Cq0Wx]
module.repositories.module.terraform_gcloud.github_branch_protection.default: Refreshing state... [id=BPR_kwDOIlveQM4Cq68i]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.repositories.module.backstage_docs.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "backstage-docs"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "backstage-docs"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories.module.mkdocs_blog.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "source repo for website"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "mkdocs-blog"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "techtales",
          + "website",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true

      + template {
          + include_all_branches = false
          + owner                = "jazzlyn"
          + repository           = "repo-template-basic"
        }
    }

  # module.repositories.module.terraform_gcloud.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "terraform-gcloud"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-gcloud"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories.module.terraform_github.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "terraform-github"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-github"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ vulnerability_alerts        = false -> true
        # (26 unchanged attributes hidden)
    }

  # module.repositories.module.terraform_gworkspace.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "IaC for Google Workspace resources with Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-gworkspace"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true

      + template {
          + include_all_branches = false
          + owner                = "jazzlyn"
          + repository           = "repo-template-terraform"
        }
    }

  # module.repositories.module.terraform_vault.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "IaC for Hashicorp Vault resources with Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-vault"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true

      + template {
          + include_all_branches = false
          + owner                = "jazzlyn"
          + repository           = "repo-template-terraform"
        }
    }

Plan: 3 to add, 3 to change, 0 to destroy.
╷
│ Error: Failed to get the data key required to decrypt the SOPS file.
│ 
│ Group 0: FAILED
│   age13evhenqvxlfxzqjxkrxc9dj9ld2pxf9yy0vmerkexw8n843p2szqp5d2qx: FAILED
│     - | failed to create reader for decrypting sops data key with
│       | age: no identity matched any of the recipients
│ 
│ Recovery failed because no master key was able to decrypt the file. In
│ order for SOPS to recover the file, at least one key has to be successful,
│ but none were.
│ 
│   with module.organization.data.sops_file.secrets,
│   on organization/main.tf line 19, in data "sops_file" "secrets":
│   19: data "sops_file" "secrets" {
│ 
╵
╷
│ Error: GET https://api.github.com/orgs/techtales-io/memberships/tyriis: 401 Requires authentication []
│ 
│   with module.organization.github_membership.admins["tyriis"],
│   on organization/memberships.tf line 5, in resource "github_membership" "admins":
│    5: resource "github_membership" "admins" {
│ 
╵
╷
│ Error: GET https://api.github.com/orgs/techtales-io/memberships/jazzlyn: 401 Requires authentication []
│ 
│   with module.organization.github_membership.admins["jazzlyn"],
│   on organization/memberships.tf line 5, in resource "github_membership" "admins":
│    5: resource "github_membership" "admins" {
│ 
╵
╷
│ Error: GET https://api.github.com/orgs/techtales-io/memberships/techtales-automation: 401 Requires authentication []
│ 
│   with module.organization.github_membership.admins["techtales-automation"],
│   on organization/memberships.tf line 5, in resource "github_membership" "admins":
│    5: resource "github_membership" "admins" {
│ 
╵
╷
│ Error: non-200 OK status code: 401 Unauthorized body: "{\"message\":\"This endpoint requires you to be authenticated.\",\"documentation_url\":\"https://docs.github.com/graphql/guides/forming-calls-with-graphql#authenticating-with-graphql\"}"
│ 
│   with module.repositories.module.backstage_docs.github_branch_protection.default,
│   on repositories/backstage_docs/branches.tf line 17, in resource "github_branch_protection" "default":
│   17: resource "github_branch_protection" "default" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/techtales-io/mkdocs-blog: 404 Not Found []
│ 
│   with module.repositories.module.mkdocs_blog.github_branch_default.repo,
│   on repositories/mkdocs_blog/branches.tf line 8, in resource "github_branch_default" "repo":
│    8: resource "github_branch_default" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/techtales-io/techtales-io.github.io/pages: 404 Not Found []
│ 
│   with module.repositories.module.techtales_io_github_io.github_repository.repo,
│   on repositories/techtales_io_github_io/repo.tf line 9, in resource "github_repository" "repo":
│    9: resource "github_repository" "repo" {
│ 
╵
╷
│ Error: non-200 OK status code: 401 Unauthorized body: "{\"message\":\"This endpoint requires you to be authenticated.\",\"documentation_url\":\"https://docs.github.com/graphql/guides/forming-calls-with-graphql#authenticating-with-graphql\"}"
│ 
│   with module.repositories.module.terraform_gcloud.github_branch_protection.default,
│   on repositories/terraform_gcloud/branches.tf line 17, in resource "github_branch_protection" "default":
│   17: resource "github_branch_protection" "default" {
│ 
╵
╷
│ Error: non-200 OK status code: 401 Unauthorized body: "{\"message\":\"This endpoint requires you to be authenticated.\",\"documentation_url\":\"https://docs.github.com/graphql/guides/forming-calls-with-graphql#authenticating-with-graphql\"}"
│ 
│   with module.repositories.module.terraform_github.github_branch_protection.default,
│   on repositories/terraform_github/branches.tf line 17, in resource "github_branch_protection" "default":
│   17: resource "github_branch_protection" "default" {
│ 
╵
╷
│ Error: Failed to get the data key required to decrypt the SOPS file.
│ 
│ Group 0: FAILED
│   age13evhenqvxlfxzqjxkrxc9dj9ld2pxf9yy0vmerkexw8n843p2szqp5d2qx: FAILED
│     - | failed to create reader for decrypting sops data key with
│       | age: no identity matched any of the recipients
│ 
│ Recovery failed because no master key was able to decrypt the file. In
│ order for SOPS to recover the file, at least one key has to be successful,
│ but none were.
│ 
│   with module.repositories.module.terraform_github.data.sops_file.secrets,
│   on repositories/terraform_github/main.tf line 19, in data "sops_file" "secrets":
│   19: data "sops_file" "secrets" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/techtales-io/terraform-gworkspace: 404 Not Found []
│ 
│   with module.repositories.module.terraform_gworkspace.github_branch_default.repo,
│   on repositories/terraform_gworkspace/branches.tf line 8, in resource "github_branch_default" "repo":
│    8: resource "github_branch_default" "repo" {
│ 
╵
╷
│ Error: Failed to get the data key required to decrypt the SOPS file.
│ 
│ Group 0: FAILED
│   age13evhenqvxlfxzqjxkrxc9dj9ld2pxf9yy0vmerkexw8n843p2szqp5d2qx: FAILED
│     - | failed to create reader for decrypting sops data key with
│       | age: no identity matched any of the recipients
│ 
│ Recovery failed because no master key was able to decrypt the file. In
│ order for SOPS to recover the file, at least one key has to be successful,
│ but none were.
│ 
│   with module.repositories.module.terraform_gworkspace.data.sops_file.secrets,
│   on repositories/terraform_gworkspace/main.tf line 19, in data "sops_file" "secrets":
│   19: data "sops_file" "secrets" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/techtales-io/terraform-vault: 404 Not Found []
│ 
│   with module.repositories.module.terraform_vault.github_branch_default.repo,
│   on repositories/terraform_vault/branches.tf line 8, in resource "github_branch_default" "repo":
│    8: resource "github_branch_default" "repo" {
│ 
╵
╷
│ Error: GET https://api.github.com/repos/techtales-io/website/pages: 404 Not Found []
│ 
│   with module.repositories.module.website.github_repository.repo,
│   on repositories/website/repo.tf line 9, in resource "github_repository" "repo":
│    9: resource "github_repository" "repo" {
│ 
╵


```
</details>